src/test/java/com/btireland/talos/ethernet/engine/soap/PBTDC-InvalidOBO.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1">
            <wsse:UsernameToken  >
                <wsse:Username>SKYWS</wsse:Username>
                <wsse:Password>iLwt5oSK</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <wag:PBTDC xmlns:wag="http://wag.btireland.ie/WAG_WS/">
            <wag:VERSION>1.0</wag:VERSION>
            <wag:ORDER>
                <wag:HEADER>
                    <wag:DATA_CONTRACT_NAME>WAG</wag:DATA_CONTRACT_NAME>
                    <wag:ORIGINATOR_CODE>EXT</wag:ORIGINATOR_CODE>
                    <wag:TRANSACTION_ID>100</wag:TRANSACTION_ID>
                    <wag:DATE_TIME_STAMP>03/02/2022 10:43:35</wag:DATE_TIME_STAMP>
                </wag:HEADER>
                <wag:ORDER_DATA>
                    <wag:OPERATOR_DETAILS>
                        <wag:NAME>SKY</wag:NAME>
                        <wag:CODE>83758</wag:CODE>
                    </wag:OPERATOR_DETAILS>
                    <wag:ORDER_DETAILS>
                        <wag:ORDER_NUMBER>1</wag:ORDER_NUMBER>
                        <wag:TYPE>PBTDC</wag:TYPE>
                        <wag:APPLICATION_DATE>20/05/2022</wag:APPLICATION_DATE>
                        <!--Optional:-->
                        <wag:OBO>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA</wag:OBO>
                    </wag:ORDER_DETAILS>
                    <wag:CUSTOMER_DETAILS>
                        <wag:ORGANISATION_NAME>string</wag:ORGANISATION_NAME>
                        <!--Optional:-->
                        <wag:ACCOUNT_NUMBER>string</wag:ACCOUNT_NUMBER>
                        <!--Optional:-->
                        <wag:LEAD_DELIVERY_MANAGER_CONTACT>
                            <wag:FIRST_NAME>string</wag:FIRST_NAME>
                            <wag:LAST_NAME>string</wag:LAST_NAME>
                            <wag:CONTACT_NUMBER>string</wag:CONTACT_NUMBER>
                            <!--Optional:-->
                            <wag:EMAIL>string</wag:EMAIL>
                        </wag:LEAD_DELIVERY_MANAGER_CONTACT>
                        <!--Optional:-->
                        <wag:CUSTOMER_INTERNAL_DETAILS>
                            <!--1 to 5 repetitions:-->
                            <wag:ATTRIBUTE>
                                <wag:NAME>string</wag:NAME>
                                <wag:VALUE>string</wag:VALUE>
                            </wag:ATTRIBUTE>
                        </wag:CUSTOMER_INTERNAL_DETAILS>
                    </wag:CUSTOMER_DETAILS>
                    <!--Optional:-->

                    <wag:CIRCUIT>
                        <wag:REF_QUOTE_ITEM_ID>1</wag:REF_QUOTE_ITEM_ID>
                        <wag:A_END>
                            <!--Optional:-->
                            <wag:SITE>
                                <!--1 to 2 repetitions:-->
                                <wag:SITE_CONTACT>
                                    <wag:FIRST_NAME>string</wag:FIRST_NAME>
                                    <wag:LAST_NAME>string</wag:LAST_NAME>
                                    <wag:CONTACT_NUMBER>string</wag:CONTACT_NUMBER>
                                    <wag:EMAIL>string</wag:EMAIL>
                                </wag:SITE_CONTACT>
                                <!--Optional:-->
                                <wag:SITE_READINESS>
                                    <!--Optional:-->
                                    <wag:LANDLORD_CONTACT>
                                        <wag:FIRST_NAME>string</wag:FIRST_NAME>
                                        <wag:LAST_NAME>string</wag:LAST_NAME>
                                        <wag:CONTACT_NUMBER>string</wag:CONTACT_NUMBER>
                                        <wag:EMAIL>string</wag:EMAIL>
                                    </wag:LANDLORD_CONTACT>
                                    <!--Optional:-->
                                    <wag:BUILDING_MGR_CONTACT>
                                        <wag:FIRST_NAME>string</wag:FIRST_NAME>
                                        <wag:LAST_NAME>string</wag:LAST_NAME>
                                        <wag:CONTACT_NUMBER>string</wag:CONTACT_NUMBER>
                                        <wag:EMAIL>string</wag:EMAIL>
                                    </wag:BUILDING_MGR_CONTACT>
                                    <wag:METHOD_INSURANCE_CERT>Y</wag:METHOD_INSURANCE_CERT>
                                    <!--Optional:-->
                                    <wag:SITE_INDUCTION>string</wag:SITE_INDUCTION>
                                </wag:SITE_READINESS>
                                <!--Optional:-->
                                <wag:COMMS_ROOM>
                                    <wag:DETAILS>string</wag:DETAILS>
                                    <wag:READY_FOR_DELIVERY>Y</wag:READY_FOR_DELIVERY>
                                    <wag:POWER_SOCKET_TYPE>3-PIN</wag:POWER_SOCKET_TYPE>
                                    <wag:CABLE_MANAGER>Y</wag:CABLE_MANAGER>
                                </wag:COMMS_ROOM>
                            </wag:SITE>
                            <wag:ACCESS>
                                <wag:ACTION_FLAG>CH</wag:ACTION_FLAG>
                                <!--Optional:-->
                                <wag:CIRCUIT_REFERENCE>string</wag:CIRCUIT_REFERENCE>
                                <!--Optional:-->
                                <wag:PRESENTATION>RJ45</wag:PRESENTATION>
                            </wag:ACCESS>
                        </wag:A_END>
                        <!--Optional:-->
                        <wag:B_END>
                            <wag:LOCATION>
                                <wag:NNI_ID>string</wag:NNI_ID>
                                <!--Optional:-->
                                <wag:VLAN>1</wag:VLAN>
                            </wag:LOCATION>
                            <wag:ACCESS>
                                <wag:ACTION_FLAG>CH</wag:ACTION_FLAG>
                            </wag:ACCESS>
                        </wag:B_END>
                        <!--Optional:-->
                        <wag:NOTES>PBTDC</wag:NOTES>
                    </wag:CIRCUIT>
                </wag:ORDER_DATA>
            </wag:ORDER>
        </wag:PBTDC>
    </soap:Body>
</soap:Envelope>
